from math import sqrt
# 29. Даны действительные числа х, у . Не пользуясь никакими операциями,
# кроме умножения, сложения и вычитания, вычислить


def xyx(x, y):
    print((x**2*3+y**2*3)-(x**3*9+y**3*9)-(y**2*4)+((x+y)*15)+(x**2*2)-(x*3)+(y*10)+6)


xyx(15, 23)