# 32. Дано действительное число я. Не пользуясь никакими другими арифметическими операциями,
# кроме умножения, получить: е) а4, а12, а28 за шесть операций.


def dz32(a):
    print(a*a, a**2*a**2, a**4*a**4, a**8*a**4, a**12*a**12, a**24*a**4)


dz32(34)
