# Дана строка. Показать третий, шестой, девятый и так далее символы.

s = 'Hello Ukraine'
print(s[3],s[6],s[9])

